## Instructions

1) Please watch recitation videos by TAs and my lecture video on Jupyternotebook before doing this lab.

2) After finishing the lab, save files as html and ipynb. 

3) To submit HW solutions, go to our course in Canvas --> Assignments --> HW 1 --> Submit Assignment --> Click "Chose file" --> choose HTML file you saved --> Click another file--> choose ipynb file--submit.

4) Once you submit, download,  and check to make sure that you have submitted the correct files. 

5) When workingfor the solutions to this lab, please do not display unnecessary data unless it is asked.  

6) Please do not share codes or the solutions in the piazza. We can still ask and clarify questions.

7) Private messages to your Instructors and TAs should be used to ask questions about codes and other details.

8) Each problem is worth 10 points.

#### Each problem is worth 10 points.

In [191]:
#import packages
import pandas as pd
import numpy as np

### Problem 1. 
Upload the .csv file titanic.csv that came with this HW in the notebook, and name it as titanic. Make sure to import panda as pd and numpy as np.  Those are the necessary packages. Read the details about the titanic data here https://data.world/nrippner/titanic-disaster-dataset. Show the head of the data and find out how many rows and columns are in the data.

In [192]:
titanic = pd.read_csv("titanic.csv")
print(titanic.head(3))

   pclass  survived                            name     sex      age  sibsp  \
0     1.0       1.0   Allen, Miss. Elisabeth Walton  female  29.0000    0.0
1     1.0       1.0  Allison, Master. Hudson Trevor    male   0.9167    1.0
2     1.0       0.0    Allison, Miss. Helen Loraine  female   2.0000    1.0

   parch  ticket      fare    cabin embarked boat  body  \
0    0.0   24160  211.3375       B5        S    2   NaN
1    2.0  113781  151.5500  C22 C26        S   11   NaN
2    2.0  113781  151.5500  C22 C26        S  NaN   NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON

In [166]:
titanic.shape

(1310, 14)

### Problem 2. 
 Make a list of variables in the titanic data set. Then classify all the variables as one of discrete, continuous, nominal, and ordinal. Explain how you determined the types of variables.

In [ ]:
var_list= list(titanic.columns)
print(var_list)

In [168]:
titanic.dtypes

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

The code above helps somewhat. Not everything is correct here. For example, pclass is just the label for class which is 1st, 2nd, and 3rd. This is clearly a categorical variables (called object in python) because it can be ordered as 1st, 2nd and 3rd or the other way around. It says float as it is entered as float.

pclass: Categorical, ordinal with 3 ordered labels

survived: Categorical, nominal with 2 values Yes = 1 and No =0. Not ordered

name: Categorical, nominal

age: Numerical, Continous, or Discrete (Usually, age should be a discrete numerical variable. In this data, you will see that some ages are decimals such as  23.5 or 0.9, etc. Months can be turned into decimals in which case, we may consider it to be continuous).

sex: Categorical, Nominal

sibsp: (Number of siblings/Spouses present onboard) Numerical, Discrete 

parch: (Number of siblings/Spouses present onboard) Numerical, Discrete

ticket: (Ticket number) Categorical, Nominal 

fare: Numerical, Continuous

cabin: (Cabin number or cabin ID) Categorical, Nominal 

embarked: (place where the passenger started, C = Cherbourg; Q = Queenstown; S = Southampton)  Categorical, Nominal

boat: (Lifeboat id or number) Categorical, Nominal 

body: (Body Identification Number) Numerical, Discrete (could as well be categorical and nominal)

home.dest: Categorical, Nominal

### Problem 3. 
 Learn more about isnull() or isna() function  here https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.isnull.html and use it to find how many missing values does each variable has. Find out which three variables have the most missing values, remove them from the data frame, and name the new data frame as titanic1.

In [181]:
titanic.isna().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [182]:
newcolumns = ['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
              'embarked', 'home.dest']
titanic1 = titanic[newcolumns]
titanic1.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,S,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"

### Problem 4. 
Filter the titanic1 data with "and" operator. https://kanoki.org/2020/01/21/pandas-dataframe-filter-with-multiple-conditions/

a) How many passengers who paid less than the average fare survived? 

b) Did a passenger who embarked journey from Queenstown and was of 40 years of age survive?

It does not matter which data you use. It is because this problem does not use the removed columns.

In [217]:
#4a
titanic[(titanic.fare <np.mean(titanic.fare) ) &  (titanic.survived==1)].shape

(319, 14)

In [184]:
#4b
titanic1[(titanic1.embarked == "Q") & (titanic1.age==40)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
683,3.0,0.0,"Bourke, Mr. John",male,40.0,1.0,1.0,364849,15.5,Q,"Ireland Chicago, IL"

In [185]:
# We could also do
titanic1[(titanic1.embarked == "Q") & (titanic.age==40)][["name","survived"]]

                 name  survived
683  Bourke, Mr. John       0.0

### Problem 5. 
Continuing with the titanic1 data set, answer the following questions.

a) Use groupby function to find out how many passengers were in each class. https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

b) Create a new column with a column name “luck”  in the titanic1 data set with the following rules. Let’s call a passenger “unlucky” if the passenger was in the first-class, paid more than the average fare, and did not survive.  On the contrary, a passenger is “lucky” if the passenger was not in the first class, paid less or equal to the average fare, and survived. Let’s call everybody else, “averageluck.”  Show the head of the data with a visible luck column.

In [186]:
#5a
titanic1.groupby(['pclass']).size()

pclass
1.0    323
2.0    277
3.0    709
dtype: int64

####  5b. This problem is where students should find their own solution creatively with the help from the internet. There are many ways to doi it. The following is  my try. It is long but works.

In [187]:
t3= titanic1 #renamed data with a short name for simplicity
t3=titanic1.reset_index(inplace=False) # changed the index to a column
t3.rename(columns={'index':'id'}, inplace=True) # remaed the index column as id

In [188]:
# creating a list of ids that will have unlucky label
ui= list(t3[(t3["pclass"]==1)& ((t3["fare"]>np.mean(t3["fare"]))& (t3["survived"] ==0))].id)
# creating a list of ids that will have lucky label
li= list(t3[(t3["pclass"]!=1)& ((t3["fare"]<=np.mean(t3["fare"]))& (t3["survived"] ==1))].id)
## creating a list of ids that will have averageluck label
rest=list(set(t3.id)-(set(ui) | set(li)))

In [189]:
#creating a column with .loc function
t3.loc[t3.id.isin(ui), 'luck'] = 'unlucky'
t3.loc[t3.id.isin(li), 'luck'] = 'lucky'
t3.loc[t3.id.isin(rest), 'luck'] = 'averageluck'
#renaming the data to titanic2
titanic2 = t3
titanic2.head(3)

,id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest,luck
0,0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,S,"St Louis, MO",averageluck
1,1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON",averageluck
2,2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON",unlucky

In [190]:
titanic2.groupby(['luck']).size()

luck
averageluck    956
lucky          277
unlucky         77
dtype: int64